Revit 2026 API

# ConcreteBrightmodeType Enumeration

---

The enumerated type representing the permitted values for the asset property "ConcreteBrightmode" from the "Concrete" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum ConcreteBrightmodeType
```
```vb
Public Enumeration ConcreteBrightmodeType
```
```cpp
public enum class ConcreteBrightmodeType
```
```fsharp
type ConcreteBrightmodeType
```

| Member name | Value | Description |
| --- | --- | --- |
| Automatic | 1 |  |
| Custom | 2 |  |
| None | 0 |  |

#### Reference

Autodesk.Revit.DB.Visual Namespace